Verified that `gp3` is supported:

```hcl
provider "aws" {
  region = "us-west-2"
}

data "aws_region" "current" {}

data "aws_partition" "current" {}

resource "aws_imagebuilder_component" "test" {
  data = yamlencode({
    phases = [{
      name = "build"
      steps = [{
        action = "ExecuteBash"
        inputs = {
          commands = ["echo 'hello world'"]
        }
        name      = "example"
        onFailure = "Continue"
      }]
    }]
    schemaVersion = 1.0
  })
  name     = "test001"
  platform = "Linux"
  version  = "1.0.0"
}

resource "aws_imagebuilder_image_recipe" "test" {
  block_device_mapping {
    ebs {
      volume_type = "gp3"
    }
  }

  component {
    component_arn = aws_imagebuilder_component.test.arn
  }

  name         = "test001"
  parent_image = "arn:${data.aws_partition.current.partition}:imagebuilder:${data.aws_region.current.name}:aws:image/amazon-linux-2-x86/x.x.x"
  version      = "1.0.0"
}
```

```console
$ terraform apply
data.aws_region.current: Refreshing state...
data.aws_partition.current: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_imagebuilder_component.test will be created
  + resource "aws_imagebuilder_component" "test" {
      + arn          = (known after apply)
      + data         = <<~EOT
            "phases":
            - "name": "build"
              "steps":
              - "action": "ExecuteBash"
                "inputs":
                  "commands":
                  - "echo 'hello world'"
                "name": "example"
                "onFailure": "Continue"
            "schemaVersion": 1
        EOT
      + date_created = (known after apply)
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + name         = "test001"
      + owner        = (known after apply)
      + platform     = "Linux"
      + type         = (known after apply)
      + version      = "1.0.0"
    }

  # aws_imagebuilder_image_recipe.test will be created
  + resource "aws_imagebuilder_image_recipe" "test" {
      + arn          = (known after apply)
      + date_created = (known after apply)
      + id           = (known after apply)
      + name         = "test001"
      + owner        = (known after apply)
      + parent_image = "arn:aws:imagebuilder:us-west-2:aws:image/amazon-linux-2-x86/x.x.x"
      + platform     = (known after apply)
      + version      = "1.0.0"

      + block_device_mapping {
          + ebs {
              + volume_type = "gp3"
            }
        }

      + component {
          + component_arn = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_imagebuilder_component.test: Creating...
aws_imagebuilder_component.test: Creation complete after 2s [id=arn:aws:imagebuilder:us-west-2:123456789012:component/test001/1.0.0/1]
aws_imagebuilder_image_recipe.test: Creating...
aws_imagebuilder_image_recipe.test: Creation complete after 3s [id=arn:aws:imagebuilder:us-west-2:123456789012:image-recipe/test001/1.0.0]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```